rab = {
    'Круті челікі': {
        'Найкуртіший челік з найкрутіших': 'Северуков.А.М',
        'Лучш з нормісів': 'Капустняк.Ф.М',
        'Найкуртіший челік з Baddaass': 'Пожиратель.О.М',
        'Коефіцієнт ефективності': [87, "ну крч харош","Севруков.А.М"],
    }
}

projects = {
    'projects': {
        "Останнні три проекта Севрукова": ['Blasteroid2', 'PUBG', 'Roblox', '- Севруков.А.М'],
        "Останнні три проекта Капустняка": ['Blasteroid1', 'РАБГ', 'Бoblox', '- Капустняк.Ф.М'],
        "Останнні три проекта Пожирателя": ['Космічний рейнджер', 'PUBG2', 'Пригоди Свофарда', '- Пожиратель.О.М'],
    }
}

usirab = {
    'Усі співробітникики': {
        'Усі співробітникики': ['Северуков', "Капустняк", 'Пожиратель', "Макаров", "Федорчук", "Прибігник", "Дорітос"]
    },
    "Посади усіх співробітників": {
        "Севруков": "Керування найкрутішими челіками, робота у командах",
        "Капустняк": "3Д-дезайнер, робота у командах",
        "Пожиратель": "Гейм-дезайнер, Робити вигляд ніби працює",
        "Макаров": "Тестер ігор",
        "Федорчук": "Розказувати анігдоти",
        "Прибігник": "2-Д дезайнер",
        "Дорітос": "Робити файні снеки"
    }
}

print('')
print('')
print("Вас вітає корпорація UMBRELLA. Що ви хочете знати?")
print('')
print('1 - Найкрутіші челіки з усіх категорій')
print('2 - Усі співробітники')
print('3 - Посади усіх співробітників')
print('4 - хто у нашій тімі найкрутіший')
print('5 - останні проекти наших Найкращих робітників')
print('')
a = input("Введіть число або off, щоб вийти: ")

while a.lower() != 'off':
    if a =='5':
        print('Останні три проекта наших найкращих робітників')
        for key, value in projects['projects'].items():
            print(key + ':', value)
    if a == '4':
        print('Найефективніший з усіх:')
        for key, value in rab['Круті челікі'].items():
            if isinstance(value[0], (int, float)) and value[0] > 75:
                print(key + ':', value)
    elif a == '1':
        print("Найкрутіші челіки з усіх категорій:")
        for key, value in rab['Круті челікі'].items():
            if key != "Посада" and key != "Коефіцієнт ефективності" and key != "Останнні три проекта":
                print(key + ':', value)
    elif a == '2':
        print("Усі співробітники:")
        for key, value in usirab["Усі співробітникики"].items():
            print(key + ":", value)

    elif a == '3':
        print("Посади усіх співробітників:")
        for key, value in usirab["Посади усіх співробітників"].items():
            print(key + ":", value)
    a = input("Введіть число або off, щоб вийти: ")
